<template>
	<div class="content">
		<h1>Пользовательское соглашение</h1>
		<p>Настоящее Соглашение определяет условия использования Пользователями материалов и сервисов сайта www.csgocrash.org (далее — «Сайт»).</p>
		<p>
			1. Общие условия<br>
              1.1. Настоящее Соглашение является публичной офертой. Получая
              доступ к материалам Сайта Пользователь считается присоединившимся
              к настоящему Соглашению.<br>
              1.2. Администрация Сайта вправе в любое время в одностороннем
              порядке изменять условия настоящего Соглашения. Такие изменения
              вступают в силу по истечении 3 (Трех) дней с момента размещения
              новой версии Соглашения на сайте. При несогласии Пользователя с
              внесенными изменениями он обязан отказаться от доступа к Сайту,
              прекратить использование материалов и сервисов Сайта.<br>
              2. Обязательства Пользователя<br>
              2.1. Использование материалов Сайта без согласия правообладателей
              не допускается. Для правомерного использования материалов Сайта
              необходимо заключение лицензионных договоров (получение лицензий)
              от Правообладателей.<br>
              2.2. При цитировании материалов Сайта, включая охраняемые
              авторские произведения, ссылка на Сайт обязательна<br>
              2.3. Пользователь предупрежден о том, что Администрация Сайта не
              несет ответственности за посещение и использование им внешних
              ресурсов, ссылки на которые могут содержаться на сайте.<br>
              2.4. Пользователь согласен с тем, что Администрация Сайта не несет
              ответственности и не имеет прямых или косвенных обязательств перед
              Пользователем в связи с любыми возможными или возникшими потерями
              или убытками, связанными с любым содержанием Сайта, регистрацией
              авторских прав и сведениями о такой регистрации, товарами или
              услугами, доступными на или полученными через внешние сайты или
              ресурсы либо иные контакты Пользователя, в которые он вступил,
              используя размещенную на Сайте информацию или ссылки на внешние
              ресурсы.<br>
              2.5. Пользователь принимает положение о том, что все материалы и
              сервисы Сайта или любая их часть могут сопровождаться рекламой.
              Пользователь согласен с тем, что Администрация Сайта не несет
              какой-либо ответственности и не имеет каких-либо обязательств в
              связи с такой рекламой.<br>
              2.6. Пользователь согласен с тем, что за использование изъянов Сайта, 
              любых недочетов или багов, Сайт способен применить любой вид санкций 
              на своё усмотрение, в том числе и блокировку в одностороннем 
              порядке без предупреждения.<br>
              3. Прочие условия<br>
              3.1. Ничто в Соглашении не может пониматься как установление между
              Пользователем и Администрации Сайта агентских отношений, отношений
              товарищества, отношений по совместной деятельности, отношений
              личного найма, либо каких-то иных отношений, прямо не
              предусмотренных Соглашением.<br>
              3.2. Признание судом какого-либо положения Соглашения
              недействительным или не подлежащим принудительному исполнению не
              влечет недействительности иных положений Соглашения.<br>
              3.3. Бездействие со стороны Администрации Сайта в случае нарушения
              кем-либо из Пользователей положений Соглашения не лишает
              Администрацию Сайта права предпринять позднее соответствующие
              действия в защиту своих интересов и защиту авторских прав на
              охраняемые в соответствии с законодательством материалы Сайта.<br>
              3.4. При пополнении баланса пользователи получают виртуальную
              валюту, которая рассчитывается в соответствии с внутренним курсом
              сайта, отображенном в поле для пополнения баланса.<br>
              3.5. При пополнении баланса пользователь гарантировано получает в
              свою собственность виртуальный предмет на сайте, который может
              использовать без каких либо ограничений.
		</p>
	</div>
</template>