<template>
	<div class="content">
		<div class="page">
			<div class="page-header">FAQ</div>
		    <div class="page-body">
		    	<div class="page-scroll">
		    		<div class="accordion">Общее положение</div>
					<div class="panel">
						Незнание или непонимание правил не освобождает от ответственности за их несоблюдение
					</div>
					<div class="accordion">Общение в игре</div>
					<div class="panel">
						<p>Запрещено оскорбление других игроков, злоупотребление нецензурными выражениями в чате и употребление нецензурных выражений при использовании
						микрофона (оскорбления игроков либо их родителей запрещены в любой форме; выражение эмоций посредством нецензурных выражений допустимо в разумных пределах)</p>
						<p>Запрещено многократное повторение одной и той же фразы в чате (flood)</p>
						<p>Запрещено при использовании микрофона захламлять эфир разговорами, не относящимися к игре</p>
						<p>Запрещено употребление выражений и имен, направленных на разжигание межнациональной и межконфессиональной (или иного вида) розни</p>
						<p>Запрещено преднамеренное и умышленное использование заведомо чужих имен и их очевидных производных с целью навредить репутации их реальных хозяев разного рода действиями</p>
						<p>Провокация игроков, направленная на действия нарушающие правила, запрещена в любой форме</p>
						<p>В микрофон игрок имеет право говорить только с 15 лет(при адекватном поведении можно и раньше)</p>
					</div>
					<div class="accordion">Читерство</div>
					<div class="panel">
						<p>Запрещено использование всякого рода читов(cheats), в том числе с целью тестирования самого чита или античитерской программы</p>
					</div>
					<div class="accordion">Игровой процесс</div>
					<div class="panel">
						<p>Запрещено злостное кемперство</p>
						<p>Котегоричесски запрещено Мониторить(говорить информацию о местоположение игрока, но разрешено говорить последнюю информацию о местоположение)</p>
						<p>Запрещено комментировать Игровые моменты - ситуацию</p>
					</div>
					<div class="accordion">Администратор сервера обязан</div>
					<div class="panel">
						<p>Знать и соблюдать общие правила серверов</p>
						<p>Использовать полномочия администратора исключительно в интересах поддержания порядка в ходе игрового процесса и нормального функционирования сервера</p>
						<p>Поддерживать игровой процесс на сервере в состоянии, удовлетворяющем большинство игроков</p>
						<p>Принимать меры дисциплинарного воздействия на игроков, препятствующих нормальному ходу игрового процесса</p>
						<p>Пресекать все виды рекламы и не допускать указных действий со своей стороны(разрешено сайты как cs.money и тому подобное)</p>
						<p>Прислушиваться к мнению игроков</p>
						<p>Перед тем как менять карту, необходимо сделать голосование</p>
						<p>Прежде чем выдать игроку бан – собрать на него неопровержимые доказательства</p>
					</div>
					<div class="accordion">Администраторам сервера запрещено</div>
					<div class="panel">
						<p>Оскорблять игроков, грубить и провоцировать игроков на оскорбления</p>
						<p>Издеваться над игроками</p>
						<p>Использовать команды которые мешают игровому процессу и дающие преимущество игроку</p>
						<p>Администратору сервера запрещается менять игровой никнейм (Никнейм должен оставаться таким же как и при покупке прав администратора, при смене сообщить главным администраторам)</p>
					</div>
					<div class="accordion">Администраторские права снимаются</div>
					<div class="panel">
						<p>По решению главного администратора</p>
						<p>При многочисленных жалобах со стороны других игроков</p>
						<p>При многочисленном нарушении или несоблюдении правил</p>
						<p>В случае не появления админа на сервере более 15 суток, при условии что это не было оговорено заранее с главным админом</p>
						<p>По общему решению с другими админами</p>
					</div>
		    	</div>
		    </div>
		</div>
		<div class="footer">
	        <div class="footer-right">
	            <router-link class="agreement" :to="{ path: '/agreement' }">Пользовательское соглашение</router-link>
	        </div>
	    </div>
	</div>
</template>

<script>
    export default {
        mounted() {
            var acc = document.getElementsByClassName("accordion"), i;
			for (i = 0; i < acc.length; i++) {
				acc[i].addEventListener("click", function() {
				    this.classList.toggle("active");
				    var panel = this.nextElementSibling;
				    if (panel.style.display == "block"){
				    	panel.style.display = "none";
				    } else {
				    	panel.style.display = "block";
				    }
				});
			}
        },
    }
</script>